CREATE DATABASE  IF NOT EXISTS `final_project` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `final_project`;
-- MySQL dump 10.13  Distrib 8.0.40, for macos14 (arm64)
--
-- Host: db-2vl2kg-kr.vpc-pub-cdb.ntruss.com    Database: final_project
-- ------------------------------------------------------
-- Server version	8.0.36

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
SET @MYSQLDUMP_TEMP_LOG_BIN = @@SESSION.SQL_LOG_BIN;
SET @@SESSION.SQL_LOG_BIN= 0;

--
-- GTID state at the beginning of the backup 
--

-- SET @@GLOBAL.GTID_PURGED=/*!80000 '+'*/ 'cc2f6008-9b28-11ef-a161-f220afbbeb6d:1-22689';

--
-- Table structure for table `city`
--

DROP TABLE IF EXISTS `city`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `city` (
  `city_code` varchar(50) NOT NULL COMMENT '시군구코드',
  `state_code` varchar(50) DEFAULT NULL COMMENT '시도코드',
  `city_name` varchar(50) NOT NULL COMMENT '시군구명',
  `city_tour` varchar(50) NOT NULL COMMENT '시도여행번호',
  `city_photo` varchar(255) DEFAULT NULL COMMENT '썸네일사진',
  PRIMARY KEY (`city_code`),
  UNIQUE KEY `UIX_city` (`city_code`),
  KEY `FK_state_TO_city` (`state_code`),
  CONSTRAINT `FK_state_TO_city` FOREIGN KEY (`state_code`) REFERENCES `state` (`state_code`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='시군구';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `city`
--

LOCK TABLES `city` WRITE;
/*!40000 ALTER TABLE `city` DISABLE KEYS */;
INSERT INTO `city` VALUES ('11000','11','전체','',NULL),('11110','11','종로구','23',NULL),('11140','11','중구','24',NULL),('11170','11','용산구','21',NULL),('11200','11','성동구','16',NULL),('11215','11','광진구','6',NULL),('11230','11','동대문구','11',NULL),('11260','11','중랑구','25',NULL),('11290','11','성북구','17',NULL),('11305','11','강북구','3',NULL),('11320','11','도봉구','10',NULL),('11350','11','노원구','9',NULL),('11380','11','은평구','22',NULL),('11410','11','서대문구','14',NULL),('11440','11','마포구','13',NULL),('11470','11','양천구','19',NULL),('11500','11','강서구','4',NULL),('11530','11','구로구','7',NULL),('11545','11','금천구','8',NULL),('11560','11','영등포구','20',NULL),('11590','11','동작구','12',NULL),('11620','11','관악구','5',NULL),('11650','11','서초구','15',NULL),('11680','11','강남구','1',NULL),('11710','11','송파구','18',NULL),('11740','11','강동구','2',NULL),('26110','26','중구','15',NULL),('26140','26','서구','11',NULL),('26170','26','동구','5',NULL),('26200','26','영도구','14',NULL),('26230','26','부산진구','7',NULL),('26260','26','동래구','6',NULL),('26290','26','남구','4',NULL),('26320','26','북구','8',NULL),('26350','26','해운대구','16',NULL),('26380','26','사하구','10',NULL),('26410','26','금정구','2',NULL),('26440','26','강서구','1',NULL),('26470','26','연제구','13',NULL),('26500','26','수영구','12',NULL),('26530','26','사상구','9',NULL),('26710','26','기장군','3',NULL),('27110','27','중구','8',NULL),('27140','27','동구','4',NULL),('27170','27','서구','6',NULL),('27200','27','남구','1',NULL),('27230','27','북구','5',NULL),('27260','27','수성구','7',NULL),('27290','27','달서구','2',NULL),('27710','27','달성군','3',NULL),('27720','27','군위군','9',NULL),('28110','28','중구','10',NULL),('28140','28','동구','5',NULL),('28177','28','미추홀구','3',NULL),('28185','28','연수구','8',NULL),('28200','28','남동구','4',NULL),('28237','28','부평구','6',NULL),('28245','28','계양구','2',NULL),('28260','28','서구','7',NULL),('28710','28','강화군','1',NULL),('28720','28','옹진군','9',NULL),('29110','29','동구','3',NULL),('29140','29','서구','5',NULL),('29155','29','남구','2',NULL),('29170','29','북구','4',NULL),('29200','29','광산구','1',NULL),('30110','30','동구','2',NULL),('30140','30','중구','5',NULL),('30170','30','서구','3',NULL),('30200','30','유성구','4',NULL),('30230','30','대덕구','1',NULL),('31110','31','중구','1',NULL),('31140','31','남구','2',NULL),('31170','31','동구','3',NULL),('31200','31','북구','4',NULL),('31710','31','울주군','5',NULL),('36000','3600','세종특별자치시','1',NULL),('41110','41','수원시','13',NULL),('41130','41','성남시','12',NULL),('41150','41','의정부시','25',NULL),('41170','41','안양시','17',NULL),('41190','41','부천시','11',NULL),('41210','41','광명시','4',NULL),('41220','41','평택시','28',NULL),('41250','41','동두천시','10',NULL),('41270','41','안산시','15',NULL),('41280','41','고양시','2',NULL),('41290','41','과천시','3',NULL),('41310','41','구리시','6',NULL),('41360','41','남양주시','9',NULL),('41370','41','오산시','22',NULL),('41390','41','시흥시','14',NULL),('41410','41','군포시','7',NULL),('41430','41','의왕시','24',NULL),('41450','41','하남시','30',NULL),('41460','41','용인시','23',NULL),('41480','41','파주시','27',NULL),('41500','41','이천시','26',NULL),('41550','41','안성시','16',NULL),('41570','41','김포시','8',NULL),('41590','41','화성시','31',NULL),('41610','41','광주시','5',NULL),('41630','41','양주시','18',NULL),('41650','41','포천시','29',NULL),('41670','41','여주시','20',NULL),('41800','41','연천군','21',NULL),('41820','41','가평군','1',NULL),('41830','41','양평군','19',NULL),('43110','43','청주시','10',NULL),('43111','43','청원군','9',NULL),('43130','43','충주시','11',NULL),('43150','43','제천시','7',NULL),('43720','43','보은군','3',NULL),('43730','43','옥천군','5',NULL),('43740','43','영동군','4',NULL),('43745','43','증평군','12',NULL),('43750','43','진천군','8',NULL),('43760','43','괴산군','1',NULL),('43770','43','음성군','6',NULL),('43800','43','단양군','2',NULL),('44130','44','천안시','12',NULL),('44150','44','공주시','1',NULL),('44180','44','보령시','5',NULL),('44200','44','아산시','9',NULL),('44210','44','서산시','7',NULL),('44230','44','논산시','3',NULL),('44250','44','계룡시','16',NULL),('44270','44','당진시','4',NULL),('44710','44','금산군','2',NULL),('44760','44','부여군','6',NULL),('44770','44','서천군','8',NULL),('44790','44','청양군','13',NULL),('44800','44','홍성군','15',NULL),('44810','44','예산군','11',NULL),('44825','44','태안군','14',NULL),('46110','46','목포시','8',NULL),('46130','46','여수시','13',NULL),('46150','46','순천시','11',NULL),('46170','46','나주시','6',NULL),('46230','46','광양시','4',NULL),('46710','46','담양군','7',NULL),('46720','46','곡성군','3',NULL),('46730','46','구례군','5',NULL),('46770','46','고흥군','2',NULL),('46780','46','보성군','10',NULL),('46790','46','화순군','24',NULL),('46800','46','장흥군','20',NULL),('46810','46','강진군','1',NULL),('46820','46','해남군','23',NULL),('46830','46','영암군','17',NULL),('46840','46','무안군','9',NULL),('46860','46','함평군','22',NULL),('46870','46','영광군','16',NULL),('46880','46','장성군','19',NULL),('46890','46','완도군','18',NULL),('46900','46','진도군','21',NULL),('46910','46','신안군','12',NULL),('47110','47','포항시','23',NULL),('47130','47','경주시','2',NULL),('47150','47','김천시','6',NULL),('47170','47','안동시','11',NULL),('47190','47','구미시','4',NULL),('47210','47','영주시','14',NULL),('47230','47','영천시','15',NULL),('47250','47','상주시','9',NULL),('47280','47','문경시','7',NULL),('47290','47','경산시','1',NULL),('47730','47','의성군','19',NULL),('47750','47','청송군','21',NULL),('47760','47','영양군','13',NULL),('47770','47','영덕군','12',NULL),('47820','47','청도군','20',NULL),('47830','47','고령군','3',NULL),('47840','47','성주군','10',NULL),('47850','47','칠곡군','22',NULL),('47900','47','예천군','16',NULL),('47920','47','봉화군','8',NULL),('47930','47','울진군','18',NULL),('47940','47','울릉군','17',NULL),('48120','48','창원시','16',NULL),('48125','48','마산시','6',NULL),('48129','48','진해시','14',NULL),('48170','48','진주시','13',NULL),('48220','48','통영시','17',NULL),('48240','48','사천시','8',NULL),('48250','48','김해시','4',NULL),('48270','48','밀양시','7',NULL),('48310','48','거제시','1',NULL),('48330','48','양산시','10',NULL),('48720','48','의령군','12',NULL),('48730','48','함안군','19',NULL),('48740','48','창녕군','15',NULL),('48820','48','고성군','3',NULL),('48840','48','남해군','5',NULL),('48850','48','하동군','18',NULL),('48860','48','산청군','9',NULL),('48870','48','함양군','20',NULL),('48880','48','거창군','2',NULL),('48890','48','합천군','21',NULL),('50110','50','제주시','4',NULL),('50130','50','서귀포시','3',NULL),('51110','42','춘천시','13',NULL),('51130','42','원주시','9',NULL),('51150','42','강릉시','1',NULL),('51170','42','동해시','3',NULL),('51190','42','태백시','14',NULL),('51210','42','속초시','5',NULL),('51230','42','삼척시','4',NULL),('51720','42','홍천군','16',NULL),('51730','42','횡성군','18',NULL),('51750','42','영월군','8',NULL),('51760','42','평창군','15',NULL),('51770','42','정선군','11',NULL),('51780','42','철원군','12',NULL),('51790','42','화천군','17',NULL),('51800','42','양구군','6',NULL),('51810','42','인제군','10',NULL),('51820','42','고성군','2',NULL),('51830','42','양양군','7',NULL),('52110','45','전주시','12',NULL),('52130','45','군산시','2',NULL),('52140','45','익산시','9',NULL),('52180','45','정읍시','13',NULL),('52190','45','남원시','4',NULL),('52210','45','김제시','3',NULL),('52710','45','완주군','8',NULL),('52720','45','진안군','14',NULL),('52730','45','무주군','5',NULL),('52740','45','장수군','11',NULL),('52750','45','임실군','10',NULL),('52770','45','순창군','7',NULL),('52790','45','고창군','1',NULL),('52800','45','부안군','6',NULL);
/*!40000 ALTER TABLE `city` ENABLE KEYS */;
UNLOCK TABLES;
SET @@SESSION.SQL_LOG_BIN = @MYSQLDUMP_TEMP_LOG_BIN;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-12-06 12:59:33
